trade_exp/src/DataProcessors/Самообслуживание/Самообслуживание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Самообслуживание</name>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/ОчередьПечати/ОчередьПечати.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9112ea84-7dc7-4182-bb49-2c3e836fb5a6">
  <name>ОчередьПечати</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <attributes extendedConfigurationObject="1ce5b02d-eb35-44a0-8011-ac8aae60062d">
    <name>Пробить</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="d5132623-b887-4f1b-8023-9a8bae1e1d06">
    <name>Документ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="c15c25ae-ff6d-4664-ba09-66c59928d787">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СтатусыВодителей/СтатусыВодителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80675a86-f1b3-42aa-bbed-b443ea3fba8a">
  <name>СтатусыВодителей</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="24cec108-8195-4aad-a265-e2495c813871">
    <name>Готов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="25759240-bbde-4bc4-8a69-610103245566">
    <name>ВРейсе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8b61fd48-1b3f-434a-9f2d-7e7107b62b28">
    <name>НеГотов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7423ebb7-3eff-4d31-ba72-320c2bd8592c">
    <name>Возвращается</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/DataProcessors/Самообслуживание/Forms/ФормаРозничнаяДоставка/Module.bsl
#Область События
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Подразделение") Тогда
		Подразделение = Параметры.Подразделение;
	Иначе
		Сообщить("У пользователя не заполнено подразделение!");
		Отказ = Истина;
	КонецЕсли;

	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);
	ОбновитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	ПодключитьОбработчикОжидания("ЗапускОбновленияСписка", 5, Ложь);
	ПодключитьОбработчикОжидания("ОчисткаНадписей", 5, Ложь);
	ПодключитьОбработчикОжидания("ПечатьИзОчереди", 5, Ложь);
	ПодключитьОбработчикОжидания("ЗакрытиеФормыПоВремени", 60, Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеФормыПоВремени()  
	Закрыть();
КонецПроцедуры	

// ОПОВЕЩЕНИЕ
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	ОчиститьСообщения();
	ВремяПоказа = 5;
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Или Источник = "РучнойВводШтрихкода" Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Или ИмяСобытия = "ScanDataManual" Тогда
			
			Если ИмяСобытия = "ScanData" Тогда
				ДанныеШтрихкодов = ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр);
				СтруктураДанных = ПодключаемоеОборудованиеУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр);
				Штрихкод = СокрЛП(СтруктураДанных.Штрихкод);
			ИначеЕсли ИмяСобытия = "ScanDataManual" Тогда
				Штрихкод = Параметр;
			КонецЕсли;
			
			// СКАНИРОВАНИЕ ВОДИТЕЛЯ
			Если Лев(Штрихкод, 4) = "8888" Тогда//1. Водитель
				Сотрудник = РСС_УправлениеОчередьюИСборкойЗаказов.ПоискСотрудникаПоШтрихкоду(Штрихкод);
				Если ЗначениеЗаполнено(Сотрудник) Тогда
					НадписьСотрудник= Сотрудник;
					
					Если АльтерраОбщегоНазначения.ЭтоВодитель(Сотрудник) Тогда
						СтатусВодителя= АльтерраОбщегоНазначения.ПолучитьТекущийСтатусВодителя(Сотрудник);
						
						// --ПЕЧАТЬ РЕЙСА--
						Если  СтатусВодителя = ПредопределенноеЗначение("Перечисление.СтатусыВодителей.Готов") Тогда   
							
							СтатусыПечати = Новый СписокЗначений;    
							СтатусыПечати.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыРейсов.ДокументыНаПогрузкуГотовы"));
							СтатусыПечати.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыРейсов.Допланирование"));
							
							Рейс= АльтерраОбщегоНазначения.ПолучитьПодготовленныйРейс(Сотрудник, СтатусыПечати);
							НомерРейса = АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Рейс, "Номер");
							ВремяВыезда = АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Рейс, "ВремяВыезда");  
							Статус = АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Рейс, "Статус");  
							
							Если Рейс = Неопределено Тогда
								ПоказатьПредупреждение(, "Нет подготовленных рейсов для водителя!", ВремяПоказа, "Сканирование водителей");
								Возврат;
							ИначеЕсли НачалоДня(ВремяВыезда) <> НачалоДня(ТекущаяДата()) Тогда 
								ПоказатьПредупреждение(, "Найденный рейс "+НомерРейса+" дата выезда рейса прошла "+ВремяВыезда, ВремяПоказа, "Сканирование водителей");
								Возврат;
							Иначе //ПЕЧАТЬ
								Сообщить("Если документы не распечатались проверьте наличие бумаги в принтере, при возникновении проблем обратитесь к дежурному логисту или администратору ТЗ.");
								
								Если НужноВзятьБанковскийТерминал(Рейс) Тогда 
									ПоказатьПредупреждение(, "Возьми терминал", ВремяПоказа+5, "Сканирование водителей");									
								КонецЕсли;
								
								ФормаРейса= ПолучитьФорму("Документ.ЗаданиеНаПеревозкуРейс.ФормаОбъекта", Новый Структура("Ключ", Рейс), ЭтаФорма,,);
								ФормаРейса.НапечататьКомплектДокументовКлиент(Истина);
								ФормаРейса= Неопределено;          
								
								Если Статус = ПредопределенноеЗначение("Перечисление.СтатусыРейсов.Допланирование") Тогда  
									НаСтатус = АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Рейс, "СтатусПередДопланированием");
								Иначе
									Если ЭтоВыбор(Рейс) Тогда
										//Выбор
										НаСтатус = ПредопределенноеЗначение("Перечисление.СтатусыРейсов.ТСВПути");
									Иначе
										НаСтатус = ПредопределенноеЗначение("Перечисление.СтатусыРейсов.ВодительДокументыПолучил");
									КонецЕсли;
								КонецЕсли;   
								
								УстановитьСтатусРейса(Рейс, НаСтатус); 
								НовыйСтатус = АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Рейс, "Статус");  
								
								Если НовыйСтатус = НаСтатус Тогда
									Сообщить("Рейс "+ НомерРейса + " переведен в статус: " + НовыйСтатус);
									АльтерраОбщегоНазначения.УстановитьСтатусВодителю(Сотрудник, ПредопределенноеЗначение("Перечисление.СтатусыВодителей.ВРейсе"), "Просканирован в ТЗ",,Рейс);
								Иначе
									ПоказатьПредупреждение(, "НЕ УДАЛОСЬ ПЕРЕВЕСТИ РЕЙС НА СТАТУС: "+НаСтатус + Символы.ПС+ "Сообщите логистам", ВремяПоказа, "Сканирование водителей");
								КонецЕсли;
								Возврат;
							КонецЕсли;
							
						// ДОСТАВКА ОСУЩЕСТВЛЕНА
						ИначеЕсли  СтатусВодителя = ПредопределенноеЗначение("Перечисление.СтатусыВодителей.ВРейсе") 
									И Не АльтерраОбщегоНазначения.ИспользуетМобильноеПриложение(Сотрудник)
									Тогда
								мСтатусов= Новый Массив;
								мСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыРейсов.ТСВПути"));
								мСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыРейсов.ТСНаПогрузке"));
								мСтатусов.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыРейсов.ВодительДокументыПолучил"));
								
								Рейс= АльтерраОбщегоНазначения.ПолучитьПодготовленныйРейс(Сотрудник, мСтатусов);
								НомерРейса= АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Рейс, "Номер");
								
								Если Рейс = Неопределено Тогда
									ПоказатьПредупреждение(, "По водителю нет рейсов в пути!", ВремяПоказа, "Сканирование водителей");
									Возврат;
								Иначе
									НаСтатус= ПредопределенноеЗначение("Перечисление.СтатусыРейсов.ДоставкаОсуществлена");
									УстановитьСтатусРейса(Рейс, НаСтатус);
									Если ПолучитьСтатус(Рейс) =  НаСтатус Тогда
										ПоказатьПредупреждение(, "Рейс "+НомерРейса+"  переведен в статус: "+ПолучитьСтатус(Рейс), ВремяПоказа, "Сканирование водителей");
										АльтерраОбщегоНазначения.УстановитьСтатусВодителю(Сотрудник, ПредопределенноеЗначение("Перечисление.СтатусыВодителей.Готов"), "Просканирован в ТЗ");
									Иначе
										ПоказатьПредупреждение(, "НЕ УДАЛОСЬ ПЕРЕВЕСТИ РЕЙС НА СТАТУС: "+НаСтатус + Символы.ПС+ "Сообщите логистам", ВремяПоказа, "Сканирование водителей");
									КонецЕсли;
									Возврат;
								КонецЕсли;
						Иначе
							// ВОДИТЕЛЬ ГОТОВ
							Если Не АльтерраОбщегоНазначения.ИспользуетМобильноеПриложение(Сотрудник) Тогда
								АльтерраОбщегоНазначения.УстановитьСтатусГотовВодителю(Сотрудник, "Просканирован на кассе");
								Если СтатусВодителя = ПредопределенноеЗначение("Перечисление.СтатусыВодителей.ВРейсе") Тогда
									ПоказатьПредупреждение(, "Зарегестрирован возврат из рейса "+Символы.ПС+"Водитель готов к работе!", ВремяПоказа, "Сканирование водителей");
								Иначе 
									ПоказатьПредупреждение(, "Готов к работе!", ВремяПоказа, "Сканирование водителей");
								КонецЕсли;
							КонецЕсли;
							Возврат;
						КонецЕсли;
						
						ПодключитьОбработчикОжидания("ЗакрытиеФормыПослеСканирования", 10, Ложь);
						
					КонецЕсли
				КонецЕсли
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЭтоВыбор(Рейс)
	Возврат Рейс.Подразделение.Код = "0А-000003";
КонецФункции

&НаСервере
Функция НужноВзятьБанковскийТерминал(Рейс)	
	Возврат Рейс.ОплатаБанковскойКартой;
КонецФункции

#КонецОбласти

#Область СканированиеВодителей

&НаКлиенте
Процедура ЗапускОбновленияСписка()
	ОбновитьСписок();
КонецПроцедуры

&НаКлиенте
Процедура ОчисткаНадписей()
	НадписьСотрудник= "";
	Информация= "";
	Элементы.Информация.Видимость= Ложь;
КонецПроцедуры

&НаСервере
Процедура ОбновитьСписок() 	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Подразделение", Подразделение, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Подразделение));
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусРейса(Рейс, Статус)
	
	УстановитьПривилегированныйРежим(Истина);
	
	РейсОбъект= Рейс.ПолучитьОбъект();	
	
	РейсОбъект.Статус= Статус;         
	Для Каждого Основание Из РейсОбъект.Основания Цикл
		Основание.НужнаПечать = Ложь;
	КонецЦикла;
	
	РейсОбъект.Записать(РежимЗаписиДокумента.Проведение);   
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры  

&НаСервере
Функция  ПолучитьСтатус(Рейс)
	Возврат Рейс.Статус;
КонецФункции 

&НаКлиенте
Процедура ЗакрытиеФормыПослеСканирования()
 Закрыть();	
КонецПроцедуры

#КонецОбласти

//Не используется
#Область Печать
&НаКлиенте
Процедура ПечатьИзОчереди()
	Рейс= ПолучитьРейсКПечати();
	Если ЗначениеЗаполнено(Рейс) Тогда
		НапечататьРейс(Рейс);
		УдалитьИзОчереди(Рейс);
		
		Если ЭтоВыбор(Рейс) Тогда
			НаСтатус= ПредопределенноеЗначение("Перечисление.СтатусыРейсов.ТСВПути");
		Иначе
			НаСтатус= ПредопределенноеЗначение("Перечисление.СтатусыРейсов.ВодительДокументыПолучил");
		КонецЕсли;
		УстановитьСтатусРейса(Рейс, НаСтатус);
		АльтерраОбщегоНазначения.УстановитьСтатусВодителю(АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Рейс, "Водитель"), ПредопределенноеЗначение("Перечисление.СтатусыВодителей.ВРейсе"), "С мобильного устройства",,Рейс);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьРейсКПечати()
	установитьПривилегированныйрежим(истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОчередьПечати.Документ КАК Документ
	|ИЗ
	|	РегистрСведений.ОчередьПечати КАК ОчередьПечати
	|ГДЕ
	|	ОчередьПечати.Подразделение = &Подразделение
	|	И ОчередьПечати.Документ.Проведен";
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Рейс= ВыборкаДетальныеЗаписи.Документ;
		Если ТипЗнч(Рейс) = Тип("ДокументСсылка.ЗаданиеНаПеревозкуРейс") 
			И НачалоДня(Рейс.ВремяВыезда) = НачалоДня(ТекущаяДата()) 
			И Рейс.Статус = Перечисления.СтатусыРейсов.ДокументыНаПогрузкуГотовы
			Тогда
			Возврат Рейс;
		КонецЕсли;
	КонецЕсли;
	установитьПривилегированныйрежим(ложь);	
	Возврат Неопределено;
КонецФункции

&НаСервере
Процедура УдалитьИзОчереди(Документ)
	РегистрыСведений.ОчередьПечати.УдалитьИзОчереди(Документ);
КонецПроцедуры

&НаКлиенте
Процедура НапечататьКомплектДокументов(Команда)
	Рейс= Элементы.Список.ТекущиеДанные.Рейс;
	
	НапечататьРейс(Рейс)
КонецПроцедуры

&НаКлиенте
Процедура НапечататьРейс(Рейс)
	ФормаРейса= ПолучитьФорму("Документ.ЗаданиеНаПеревозкуРейс.ФормаОбъекта", Новый Структура("Ключ", Рейс), ЭтаФорма,,);
	ФормаРейса.НапечататьКомплектДокументовКлиент(Истина);
	ФормаРейса= Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура Меню(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СканироватьШтрихкод(Команда)
	
	Оповестить("ScanDataManual", РучнойШтрихкод, "РучнойВводШтрихкода")
	
КонецПроцедуры

#КонецОбласти
